Revit 2027 API
IFCFileModelOptions.SchemaFile Property
 The full name of an IFC schema file.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SchemaFile { get; set; }
Public Property SchemaFile As String
	Get
	Set
public:
property String^ SchemaFile {
	String^ get ();
	void set (String^ value);
}
member SchemaFile : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCFileModelOptions Class
Autodesk.Revit.DB.IFC Namespace